Repository: kelvinkosbab/KozBon
Catalog: KozBonPackages/BonjourLocalization/Sources/Resources/Localizable.xcstrings
Source language: en
Languages: ar, de, es, fr, he, ja, zh_hans

# nav_nearby_services
source: Nearby
ar: قريبة
de: In der Nähe
es: Cercanos
fr: À proximité
he: בקרבת מקום
ja: 近く
zh_hans: 附近

# nav_broadcast_service
source: Broadcast service
ar: بث خدمة
de: Dienst senden
es: Transmitir servicio
fr: Diffuser un service
he: שדר שירות
ja: サービスをブロードキャスト
zh_hans: 广播服务

# nav_supported_services
source: Library
ar: المكتبة
de: Bibliothek
es: Biblioteca
fr: Bibliothèque
he: ספרייה
ja: ライブラリ
zh_hans: 资料库

# nav_create_txt_record
source: Create TXT record
ar: إنشاء سجل TXT
de: Txt-Eintrag erstellen
es: Crear registro Txt
fr: Créer un enregistrement Txt
he: צור רשומת TXT
ja: Txtレコードを作成
zh_hans: 创建 Txt 记录

# nav_create_service_type
source: Create service type
ar: إنشاء نوع خدمة
de: Diensttyp erstellen
es: Crear tipo de servicio
fr: Créer un type de service
he: צור סוג שירות
ja: サービスタイプを作成
zh_hans: 创建服务类型

# nav_edit_service_type
source: Edit service type
ar: تعديل نوع الخدمة
de: Diensttyp bearbeiten
es: Editar tipo de servicio
fr: Modifier le type de service
he: ערוך סוג שירות
ja: サービスタイプを編集
zh_hans: 编辑服务类型

# nav_settings
source: Your preferences
ar: تفضيلاتك
de: Ihre Einstellungen
es: Tus preferencias
fr: Vos préférences
he: ההעדפות שלך
ja: あなたの設定
zh_hans: 您的偏好设置

# tab_bonjour
source: Discover
ar: الاكتشاف
de: Entdecken
es: Descubrir
fr: Découvrir
he: גילוי
ja: 検出
zh_hans: 发现

# tab_supported_services
source: Library
ar: المكتبة
de: Bibliothek
es: Biblioteca
fr: Bibliothèque
he: ספרייה
ja: ライブラリ
zh_hans: 资料库

# section_published
source: Published
ar: المنشورة
de: Veröffentlicht
es: Publicado
fr: Publié
he: פורסם
ja: 公開済み
zh_hans: 已发布

# section_information
source: Information
ar: المعلومات
de: Informationen
es: Información
fr: Informations
he: מידע
ja: 情報
zh_hans: 信息

# section_ip_addresses
source: IP addresses
ar: عناوين IP
de: IP-Adressen
es: Direcciones IP
fr: Adresses IP
he: כתובות IP
ja: IPアドレス
zh_hans: IP 地址

# section_txt_records
source: TXT records
ar: سجلات TXT
de: TXT-Einträge
es: Registros TXT
fr: Enregistrements TXT
he: רשומות TXT
ja: TXTレコード
zh_hans: TXT 记录

# section_service_type
source: Service Type
ar: نوع الخدمة
de: Diensttyp
es: Tipo de servicio
fr: Type de service
he: סוג שירות
ja: サービスタイプ
zh_hans: 服务类型

# section_port_number
source: Port number
ar: رقم المنفذ
de: Portnummer
es: Número de puerto
fr: Numéro de port
he: מספר יציאה
ja: ポート番号
zh_hans: 端口号

# section_service_domain
source: Service domain
ar: نطاق الخدمة
de: Dienstdomäne
es: Dominio del servicio
fr: Domaine du service
he: תחום השירות
ja: サービスドメイン
zh_hans: 服务域

# section_custom_service_types
source: Custom service types
ar: أنواع الخدمات المخصصة
de: Benutzerdefinierte Diensttypen
es: Tipos de servicio personalizados
fr: Types de service personnalisés
he: סוגי שירות מותאמים אישית
ja: カスタムサービスタイプ
zh_hans: 自定义服务类型

# section_builtin_service_types
source: Built-in service types
ar: أنواع الخدمات المضمّنة
de: Integrierte Diensttypen
es: Tipos de servicio integrados
fr: Types de service intégrés
he: סוגי שירות מובנים
ja: 組み込みサービスタイプ
zh_hans: 内置服务类型

# section_record_key
source: Record key
ar: مفتاح السجل
de: Eintragsschlüssel
es: Clave del registro
fr: Clé de l'enregistrement
he: מפתח רשומה
ja: レコードキー
zh_hans: 记录键

# section_record_value
source: Record value
ar: قيمة السجل
de: Eintragswert
es: Valor del registro
fr: Valeur de l'enregistrement
he: ערך רשומה
ja: レコード値
zh_hans: 记录值

# section_service_name
source: Service name
ar: اسم الخدمة
de: Dienstname
es: Nombre del servicio
fr: Nom du service
he: שם השירות
ja: サービス名
zh_hans: 服务名称

# section_bonjour_type
source: Bonjour type
ar: نوع Bonjour
de: Bonjour-Typ
es: Tipo Bonjour
fr: Type Bonjour
he: סוג Bonjour
ja: Bonjourタイプ
zh_hans: Bonjour 类型

# section_additional_details
source: Additional details
ar: تفاصيل إضافية
de: Weitere Details
es: Detalles adicionales
fr: Détails supplémentaires
he: פרטים נוספים
ja: 追加情報
zh_hans: 其他详情

# detail_name
source: Name
ar: الاسم
es: Nombre
fr: Nom
he: שם
ja: 名前
zh_hans: 名称

# detail_hostname
source: Hostname
ar: اسم المضيف
es: Nombre de host
fr: Nom d'hôte
he: שם מארח
ja: ホスト名
zh_hans: 主机名

# detail_full_type
source: Full type
ar: النوع الكامل
de: Vollständiger Typ
es: Tipo completo
fr: Type complet
he: סוג מלא
ja: 完全な型
zh_hans: 完整类型

# detail_type
source: Type
ar: النوع
de: Typ
es: Tipo
he: סוג
ja: タイプ
zh_hans: 类型

# detail_transport_layer
source: Transport layer
ar: طبقة النقل
de: Transportschicht
es: Capa de transporte
fr: Couche de transport
he: שכבת תעבורה
ja: トランスポート層
zh_hans: 传输层

# detail_domain
source: Domain
ar: النطاق
de: Domäne
es: Dominio
fr: Domaine
he: תחום
ja: ドメイン
zh_hans: 域

# detail_protocol_information
source: Protocol information
ar: معلومات البروتوكول
de: Protokollinformationen
es: Información del protocolo
fr: Informations sur le protocole
he: מידע על פרוטוקול
ja: プロトコル情報
zh_hans: 协议信息

# detail_details
source: Details
ar: التفاصيل
es: Detalles
fr: Détails
he: פרטים
ja: 詳細
zh_hans: 详情

# detail_device_type
source: Device Type
ar: نوع الجهاز
de: Gerätetyp
es: Tipo de dispositivo
fr: Type d'appareil
he: סוג מכשיר
ja: デバイスの種類
zh_hans: 设备类型

# detail_service_name
source: Service Name
ar: اسم الخدمة
de: Dienstname
es: Nombre del servicio
fr: Nom du service
he: שם השירות
ja: サービス名
zh_hans: 服务名称

# button_create
source: Create
ar: إنشاء
de: Erstellen
es: Crear
fr: Créer
he: צור
ja: 作成
zh_hans: 创建

# button_cancel
source: Cancel
ar: إلغاء
de: Abbrechen
es: Cancelar
fr: Annuler
he: בטל
ja: キャンセル
zh_hans: 取消

# button_done
source: Done
ar: تم
de: Fertig
es: Listo
fr: Terminé
he: סיום
ja: 完了
zh_hans: 完成

# button_sort
source: Sort
ar: ترتيب
de: Sortieren
es: Ordenar
fr: Trier
he: מיין
ja: 並べ替え
zh_hans: 排序

# button_add_txt_record
source: Add TXT record
ar: إضافة سجل TXT
de: TXT-Eintrag hinzufügen
es: Agregar registro TXT
fr: Ajouter un enregistrement TXT
he: הוסף רשומת TXT
ja: TXTレコードを追加
zh_hans: 添加 TXT 记录

# button_remove
source: Remove
ar: إزالة
de: Entfernen
es: Eliminar
fr: Supprimer
he: הסר
ja: 削除
zh_hans: 移除

# button_edit
source: Edit
ar: تعديل
de: Bearbeiten
es: Editar
fr: Modifier
he: ערוך
ja: 編集
zh_hans: 编辑

# button_delete
source: Delete
ar: حذف
de: Löschen
es: Eliminar
fr: Supprimer
he: מחק
ja: 削除
zh_hans: 删除

# button_stop
source: Stop
ar: إيقاف
de: Stoppen
es: Detener
fr: Arrêter
he: עצור
ja: 停止
zh_hans: 停止

# chat_confirm_delete_service_type_format
source: Are you sure you want to delete the %@ service type?
ar: هل أنت متأكد أنك تريد حذف نوع الخدمة %@؟
de: Möchtest du den Diensttyp %@ wirklich löschen?
es: ¿Seguro que quieres eliminar el tipo de servicio %@?
fr: Voulez-vous vraiment supprimer le type de service %@ ?
he: האם אתה בטוח שברצונך למחוק את סוג השירות %@?
ja: サービスタイプ「%@」を削除してもよろしいですか？
zh_hans: 确定要删除服务类型「%@」吗？

# chat_confirm_stop_broadcast_format
source: Are you sure you want to stop broadcasting %@?
ar: هل أنت متأكد أنك تريد إيقاف بث %@؟
de: Möchtest du die Übertragung von %@ wirklich beenden?
es: ¿Seguro que quieres dejar de difundir %@?
fr: Voulez-vous vraiment arrêter la diffusion de %@ ?
he: האם אתה בטוח שברצונך להפסיק לשדר את %@?
ja: 「%@」のブロードキャストを停止してもよろしいですか？
zh_hans: 确定要停止广播「%@」吗？

# button_ok
source: OK
ar: موافق
es: Aceptar
he: אישור
zh_hans: 好

# button_broadcast_bonjour_service
source: Broadcast Bonjour Service
ar: بث خدمة Bonjour
de: Bonjour-Dienst senden
es: Transmitir servicio Bonjour
fr: Diffuser un service Bonjour
he: שדר שירות Bonjour
ja: Bonjourサービスをブロードキャスト
zh_hans: 广播 Bonjour 服务

# button_broadcast
source: Broadcast
ar: بث
de: Senden
es: Transmitir
fr: Diffuser
he: שדר
ja: ブロードキャスト
zh_hans: 广播

# button_create_service_type
source: Create Service Type
ar: إنشاء نوع خدمة
de: Diensttyp erstellen
es: Crear tipo de servicio
fr: Créer un type de service
he: צור סוג שירות
ja: サービスタイプを作成
zh_hans: 创建服务类型

# button_create_custom_service_type
source: Create custom service type
ar: إنشاء نوع خدمة مخصص
de: Benutzerdefinierten Diensttyp erstellen
es: Crear tipo de servicio personalizado
fr: Créer un type de service personnalisé
he: צור סוג שירות מותאם אישית
ja: カスタムサービスタイプを作成
zh_hans: 创建自定义服务类型

# button_broadcast_service
source: Broadcast Service
ar: بث الخدمة
de: Dienst senden
es: Transmitir servicio
fr: Diffuser le service
he: שדר שירות
ja: サービスをブロードキャスト
zh_hans: 广播服务

# action_copy_hostname
source: Copy Hostname
ar: نسخ اسم المضيف
de: Hostname kopieren
es: Copiar nombre de host
fr: Copier le nom d'hôte
he: העתק שם מארח
ja: ホスト名をコピー
zh_hans: 拷贝主机名

# action_copy_ip_address
source: Copy IP Address
ar: نسخ عنوان IP
de: IP-Adresse kopieren
es: Copiar dirección IP
fr: Copier l'adresse IP
he: העתק כתובת IP
ja: IPアドレスをコピー
zh_hans: 拷贝 IP 地址

# action_copy_service_type
source: Copy Service Type
ar: نسخ نوع الخدمة
de: Diensttyp kopieren
es: Copiar tipo de servicio
fr: Copier le type de service
he: העתק סוג שירות
ja: サービスタイプをコピー
zh_hans: 拷贝服务类型

# action_copy_address
source: Copy Address
ar: نسخ العنوان
de: Adresse kopieren
es: Copiar dirección
fr: Copier l'adresse
he: העתק כתובת
ja: アドレスをコピー
zh_hans: 拷贝地址

# action_copy_ip_only
source: Copy IP Only
ar: نسخ IP فقط
de: Nur IP kopieren
es: Copiar solo IP
fr: Copier l'IP uniquement
he: העתק רק IP
ja: IPのみコピー
zh_hans: 仅拷贝 IP

# action_copy_record
source: Copy Record
ar: نسخ السجل
de: Eintrag kopieren
es: Copiar registro
fr: Copier l'enregistrement
he: העתק רשומה
ja: レコードをコピー
zh_hans: 拷贝记录

# action_copy_value
source: Copy Value
ar: نسخ القيمة
de: Wert kopieren
es: Copiar valor
fr: Copier la valeur
he: העתק ערך
ja: 値をコピー
zh_hans: 拷贝值

# action_copy_full_type
source: Copy Full Type
ar: نسخ النوع الكامل
de: Vollständigen Typ kopieren
es: Copiar tipo completo
fr: Copier le type complet
he: העתק סוג מלא
ja: 完全な型をコピー
zh_hans: 拷贝完整类型

# action_copy_name
source: Copy Name
ar: نسخ الاسم
de: Name kopieren
es: Copiar nombre
fr: Copier le nom
he: העתק שם
ja: 名前をコピー
zh_hans: 拷贝名称

# action_copy_details
source: Copy Details
ar: نسخ التفاصيل
de: Details kopieren
es: Copiar detalles
fr: Copier les détails
he: העתק פרטים
ja: 詳細をコピー
zh_hans: 拷贝详情

# action_open_new_window
source: Open in New Window
ar: فتح في نافذة جديدة
de: In neuem Fenster öffnen
es: Abrir en nueva ventana
fr: Ouvrir dans une nouvelle fenêtre
he: פתח בחלון חדש
ja: 新しいウインドウで開く
zh_hans: 在新窗口中打开

# placeholder_select_service_type
source: Select a service type to broadcast
ar: اختر نوع خدمة للبث
de: Diensttyp zum Senden auswählen
es: Selecciona un tipo de servicio para transmitir
fr: Sélectionnez un type de service à diffuser
he: בחר סוג שירות לשידור
ja: ブロードキャストするサービスタイプを選択
zh_hans: 选择要广播的服务类型

# placeholder_service_port_number
source: Service port number
ar: رقم منفذ الخدمة
de: Portnummer des Dienstes
es: Número de puerto del servicio
fr: Numéro de port du service
he: מספר יציאת השירות
ja: サービスのポート番号
zh_hans: 服务端口号

# placeholder_service_domain
source: Service domain
ar: نطاق الخدمة
de: Dienstdomäne
es: Dominio del servicio
fr: Domaine du service
he: תחום השירות
ja: サービスドメイン
zh_hans: 服务域

# placeholder_txt_record_key
source: TXT Record Key
ar: مفتاح سجل TXT
de: TXT-Eintragsschlüssel
es: Clave del registro TXT
fr: Clé de l'enregistrement TXT
he: מפתח רשומת TXT
ja: TXTレコードキー
zh_hans: TXT 记录键

# placeholder_txt_record_value
source: TXT Record Value
ar: قيمة سجل TXT
de: TXT-Eintragswert
es: Valor del registro TXT
fr: Valeur de l'enregistrement TXT
he: ערך רשומת TXT
ja: TXTレコード値
zh_hans: TXT 记录值

# placeholder_service_name
source: Service name
ar: اسم الخدمة
de: Dienstname
es: Nombre del servicio
fr: Nom du service
he: שם השירות
ja: サービス名
zh_hans: 服务名称

# placeholder_type_definition
source: Type definition
ar: تعريف النوع
de: Typdefinition
es: Definición de tipo
fr: Définition du type
he: הגדרת סוג
ja: タイプ定義
zh_hans: 类型定义

# placeholder_additional_information
source: Describe what this service does…
ar: صف ما تفعله هذه الخدمة...
de: Beschreibe, was dieser Dienst tut…
es: Describe qué hace este servicio…
fr: Décrivez ce que fait ce service…
he: תאר מה השירות הזה עושה...
ja: このサービスの説明を入力…
zh_hans: 描述此服务的功能…

# placeholder_search
source: Search for ...
ar: ابحث عن...
de: Suchen ...
es: Buscar ...
fr: Rechercher ...
he: חפש...
ja: 検索 ...
zh_hans: 搜索 ...

# error_service_type_required
source: Service type required
ar: نوع الخدمة مطلوب
de: Diensttyp erforderlich
es: Se requiere tipo de servicio
fr: Type de service requis
he: נדרש סוג שירות
ja: サービスタイプが必要です
zh_hans: 需要服务类型

# error_port_number_required
source: Port number required
ar: رقم المنفذ مطلوب
de: Portnummer erforderlich
es: Se requiere número de puerto
fr: Numéro de port requis
he: נדרש מספר יציאה
ja: ポート番号が必要です
zh_hans: 需要端口号

# error_port_min
source: Port number must be at least %lld
ar: يجب أن يكون رقم المنفذ %lld على الأقل
de: Portnummer muss mindestens %lld sein
es: El número de puerto debe ser al menos %lld
fr: Le numéro de port doit être au moins %lld
he: מספר היציאה חייב להיות לפחות %lld
ja: ポート番号は %lld 以上にしてください
zh_hans: 端口号不能小于 %lld

# error_port_max
source: Port number must be %lld or less
ar: يجب أن يكون رقم المنفذ %lld أو أقل
de: Portnummer darf höchstens %lld sein
es: El número de puerto debe ser %lld o menos
fr: Le numéro de port doit être %lld ou moins
he: מספר היציאה חייב להיות %lld או פחות
ja: ポート番号は %lld 以下にしてください
zh_hans: 端口号不能大于 %lld

# error_domain_required
source: Domain is required
ar: النطاق مطلوب
de: Domäne ist erforderlich
es: Se requiere el dominio
fr: Le domaine est requis
he: נדרש תחום
ja: ドメインが必要です
zh_hans: 需要域

# error_publish_failed
source: Failed to publish service: %@
ar: فشل نشر الخدمة: %@
de: Dienst konnte nicht veröffentlicht werden: %@
es: Error al publicar el servicio: %@
fr: Échec de la publication du service : %@
he: פרסום השירות נכשל: %@
ja: サービスの公開に失敗しました: %@
zh_hans: 发布服务失败: %@

# error_txt_key_required
source: TXT record key required
ar: مفتاح سجل TXT مطلوب
de: TXT-Eintragsschlüssel erforderlich
es: Se requiere clave del registro TXT
fr: Clé de l'enregistrement TXT requise
he: נדרש מפתח לרשומת TXT
ja: TXTレコードキーが必要です
zh_hans: 需要 TXT 记录键

# error_txt_value_required
source: TXT record value required
ar: قيمة سجل TXT مطلوبة
de: TXT-Eintragswert erforderlich
es: Se requiere valor del registro TXT
fr: Valeur de l'enregistrement TXT requise
he: נדרש ערך לרשומת TXT
ja: TXTレコード値が必要です
zh_hans: 需要 TXT 记录值

# error_txt_key_duplicate
source: A record with this key already exists
ar: يوجد سجل بهذا المفتاح بالفعل
de: Ein Eintrag mit diesem Schlüssel existiert bereits
es: Ya existe un registro con esta clave
fr: Un enregistrement avec cette clé existe déjà
he: כבר קיימת רשומה עם המפתח הזה
ja: このキーのレコードは既に存在します
zh_hans: 具有此键的记录已存在

# error_name_required
source: Name required
ar: الاسم مطلوب
de: Name erforderlich
es: Se requiere nombre
fr: Nom requis
he: נדרש שם
ja: 名前が必要です
zh_hans: 需要名称

# error_type_required
source: Type required
ar: النوع مطلوب
de: Typ erforderlich
es: Se requiere tipo
fr: Type requis
he: נדרש סוג
ja: タイプが必要です
zh_hans: 需要类型

# error_details_required
source: Details required
ar: التفاصيل مطلوبة
de: Details erforderlich
es: Se requieren detalles
fr: Détails requis
he: נדרשים פרטים
ja: 詳細が必要です
zh_hans: 需要详情

# error_already_exists
source: Already Exists
ar: موجود مسبقًا
de: Existiert bereits
es: Ya existe
fr: Existe déjà
he: כבר קיים
ja: 既に存在します
zh_hans: 已存在

# empty_no_active_services
source: No active Bonjour services
ar: لا توجد خدمات Bonjour نشطة
de: Keine aktiven Bonjour-Dienste
es: No hay servicios Bonjour activos
fr: Aucun service Bonjour actif
he: אין שירותי Bonjour פעילים
ja: アクティブなBonjourサービスはありません
zh_hans: 没有活跃的 Bonjour 服务

# empty_no_local_network_title
source: Not connected to Wi-Fi
ar: غير متصل بشبكة Wi-Fi
de: Nicht mit WLAN verbunden
es: No conectado a Wi-Fi
fr: Pas de connexion Wi-Fi
he: לא מחובר ל-Wi-Fi
ja: Wi-Fiに接続されていません
zh_hans: 未连接到 Wi-Fi

# empty_no_local_network_description
source: Bonjour services live on the local network. Connect to Wi-Fi (or Ethernet on Mac) to discover what's nearby.
ar: تعمل خدمات Bonjour على الشبكة المحلية. اتصل بشبكة Wi-Fi (أو Ethernet على جهاز Mac) لاكتشاف ما هو موجود في الجوار.
de: Bonjour-Dienste leben im lokalen Netzwerk. Verbinde dich mit WLAN (oder mit Ethernet auf dem Mac), um zu sehen, was in der Nähe ist.
es: Los servicios Bonjour viven en la red local. Conéctate a Wi-Fi (o Ethernet en Mac) para descubrir lo que hay cerca.
fr: Les services Bonjour vivent sur le réseau local. Connectez-vous au Wi-Fi (ou à l'Ethernet sur Mac) pour découvrir ce qui se trouve à proximité.
he: שירותי Bonjour פועלים על הרשת המקומית. התחבר ל-Wi-Fi (או ל-Ethernet במחשבי Mac) כדי לגלות מה נמצא בקרבת מקום.
ja: Bonjourサービスはローカルネットワーク上で動作します。Wi-Fi（Macの場合はイーサネット）に接続して、近くにあるものを検出してください。
zh_hans: Bonjour 服务运行在本地网络上。请连接 Wi-Fi（在 Mac 上可使用以太网），以便发现附近的服务。

# empty_select_service
source: Select a Service
ar: اختر خدمة
de: Dienst auswählen
es: Selecciona un servicio
fr: Sélectionnez un service
he: בחר שירות
ja: サービスを選択
zh_hans: 选择服务

# empty_select_service_description
source: Choose a nearby service to view its details.
ar: اختر خدمة قريبة لعرض تفاصيلها.
de: Wählen Sie einen Dienst in der Nähe, um seine Details anzuzeigen.
es: Elige un servicio cercano para ver sus detalles.
fr: Choisissez un service à proximité pour afficher ses détails.
he: בחר שירות בקרבת מקום כדי לצפות בפרטיו.
ja: 近くのサービスを選択して詳細を表示します。
zh_hans: 选择附近的服务以查看其详情。

# empty_select_service_type
source: Select a Service Type
ar: اختر نوع خدمة
de: Diensttyp auswählen
es: Selecciona un tipo de servicio
fr: Sélectionnez un type de service
he: בחר סוג שירות
ja: サービスタイプを選択
zh_hans: 选择服务类型

# empty_select_service_type_description
source: Choose a service type to view its details.
ar: اختر نوع خدمة لعرض تفاصيله.
de: Wählen Sie einen Diensttyp, um seine Details anzuzeigen.
es: Elige un tipo de servicio para ver sus detalles.
fr: Choisissez un type de service pour afficher ses détails.
he: בחר סוג שירות כדי לצפות בפרטיו.
ja: サービスタイプを選択して詳細を表示します。
zh_hans: 选择服务类型以查看其详情。

# sort_host_name_asc
source: Host Name A → Z
ar: اسم المضيف أ → ي
es: Nombre de host A → Z
fr: Nom d’hôte A → Z
he: שם מארח א → ת
ja: ホスト名 A → Z
zh_hans: 主机名 A → Z

# sort_host_name_desc
source: Host Name Z → A
ar: اسم المضيف ي → أ
es: Nombre de host Z → A
fr: Nom d’hôte Z → A
he: שם מארח ת → א
ja: ホスト名 Z → A
zh_hans: 主机名 Z → A

# alert_scan_error
source: Scan Error
ar: خطأ في الفحص
de: Suchfehler
es: Error de escaneo
fr: Erreur de recherche
he: שגיאת סריקה
ja: スキャンエラー
zh_hans: 扫描错误

# dialog_delete_service_type
source: Are you sure you want to delete this service type?
ar: هل أنت متأكد أنك تريد حذف نوع الخدمة هذا؟
de: Möchten Sie diesen Diensttyp wirklich löschen?
es: ¿Estás seguro de que deseas eliminar este tipo de servicio?
fr: Voulez-vous vraiment supprimer ce type de service ?
he: האם אתה בטוח שברצונך למחוק את סוג השירות הזה?
ja: このサービスタイプを削除してもよろしいですか？
zh_hans: 确定要删除此服务类型吗？

# a11y_create
source: Create
ar: إنشاء
de: Erstellen
es: Crear
fr: Créer
he: צור
ja: 作成
zh_hans: 创建

# a11y_create_hint
source: Create or broadcast a new service
ar: إنشاء أو بث خدمة جديدة
de: Neuen Dienst erstellen oder senden
es: Crear o transmitir un nuevo servicio
fr: Créer ou diffuser un nouveau service
he: צור או שדר שירות חדש
ja: 新しいサービスを作成またはブロードキャスト
zh_hans: 创建或广播新服务

# a11y_create_service_type_hint
source: Create a custom service type
ar: إنشاء نوع خدمة مخصص
de: Benutzerdefinierten Diensttyp erstellen
es: Crear un tipo de servicio personalizado
fr: Créer un type de service personnalisé
he: צור סוג שירות מותאם אישית
ja: カスタムサービスタイプを作成
zh_hans: 创建自定义服务类型

# a11y_port_number
source: Port number
ar: رقم المنفذ
de: Portnummer
es: Número de puerto
fr: Numéro de port
he: מספר יציאה
ja: ポート番号
zh_hans: 端口号

# a11y_service_domain
source: Service domain
ar: نطاق الخدمة
de: Dienstdomäne
es: Dominio del servicio
fr: Domaine du service
he: תחום השירות
ja: サービスドメイン
zh_hans: 服务域

# a11y_service_domain_hint
source: Enter the domain for the service, defaults to local
ar: أدخل نطاق الخدمة، الافتراضي هو local
de: Domäne für den Dienst eingeben, Standard ist local
es: Introduce el dominio del servicio, por defecto local
fr: Entrez le domaine du service, par défaut local
he: הזן את התחום של השירות, ברירת המחדל היא local
ja: サービスのドメインを入力、デフォルトは local
zh_hans: 输入服务的域，默认为 local

# a11y_add_txt_record_hint
source: Double tap to add a new TXT record
ar: انقر نقرًا مزدوجًا لإضافة سجل TXT جديد
de: Doppeltippen, um einen neuen TXT-Eintrag hinzuzufügen
es: Toca dos veces para agregar un nuevo registro TXT
fr: Touchez deux fois pour ajouter un nouvel enregistrement TXT
he: הקש פעמיים כדי להוסיף רשומת TXT חדשה
ja: ダブルタップで新しいTXTレコードを追加
zh_hans: 双击以添加新的 TXT 记录

# a11y_edit_record_hint
source: Double tap to edit this record
ar: انقر نقرًا مزدوجًا لتعديل هذا السجل
de: Doppeltippen, um diesen Eintrag zu bearbeiten
es: Toca dos veces para editar este registro
fr: Touchez deux fois pour modifier cet enregistrement
he: הקש פעמיים כדי לערוך את הרשומה הזו
ja: ダブルタップでこのレコードを編集
zh_hans: 双击以编辑此记录

# a11y_long_press_copy_address
source: Long press to copy address
ar: اضغط مطوّلاً لنسخ العنوان
de: Lange drücken, um die Adresse zu kopieren
es: Mantén pulsado para copiar la dirección
fr: Appui long pour copier l'adresse
he: הקש ארוכות כדי להעתיק את הכתובת
ja: 長押しでアドレスをコピー
zh_hans: 长按以拷贝地址

# a11y_long_press_copy_record
source: Long press to copy record
ar: اضغط مطوّلاً لنسخ السجل
de: Lange drücken, um den Eintrag zu kopieren
es: Mantén pulsado para copiar el registro
fr: Appui long pour copier l'enregistrement
he: הקש ארוכות כדי להעתיק את הרשומה
ja: 長押しでレコードをコピー
zh_hans: 长按以拷贝记录

# a11y_txt_record_key
source: TXT record key
ar: مفتاح سجل TXT
de: TXT-Eintragsschlüssel
es: Clave del registro TXT
fr: Clé de l'enregistrement TXT
he: מפתח של רשומת TXT
ja: TXTレコードキー
zh_hans: TXT 记录键

# a11y_txt_record_key_hint
source: Enter the key for this TXT record
ar: أدخل المفتاح لسجل TXT هذا
de: Schlüssel für diesen TXT-Eintrag eingeben
es: Introduce la clave de este registro TXT
fr: Entrez la clé de cet enregistrement TXT
he: הזן את המפתח עבור רשומת ה-TXT הזו
ja: このTXTレコードのキーを入力
zh_hans: 输入此 TXT 记录的键

# a11y_txt_record_value
source: TXT record value
ar: قيمة سجل TXT
de: TXT-Eintragswert
es: Valor del registro TXT
fr: Valeur de l'enregistrement TXT
he: ערך של רשומת TXT
ja: TXTレコード値
zh_hans: TXT 记录值

# a11y_txt_record_value_hint
source: Enter the value for this TXT record
ar: أدخل القيمة لسجل TXT هذا
de: Wert für diesen TXT-Eintrag eingeben
es: Introduce el valor de este registro TXT
fr: Entrez la valeur de cet enregistrement TXT
he: הזן את הערך עבור רשומת ה-TXT הזו
ja: このTXTレコードの値を入力
zh_hans: 输入此 TXT 记录的值

# a11y_service_name
source: Service name
ar: اسم الخدمة
de: Dienstname
es: Nombre del servicio
fr: Nom du service
he: שם השירות
ja: サービス名
zh_hans: 服务名称

# a11y_service_name_hint
source: Enter a display name for this service type
ar: أدخل اسم عرض لنوع الخدمة هذا
de: Anzeigename für diesen Diensttyp eingeben
es: Introduce un nombre para este tipo de servicio
fr: Entrez un nom d'affichage pour ce type de service
he: הזן שם תצוגה עבור סוג השירות הזה
ja: このサービスタイプの表示名を入力
zh_hans: 输入此服务类型的显示名称

# a11y_bonjour_type
source: Bonjour type
ar: نوع Bonjour
de: Bonjour-Typ
es: Tipo Bonjour
fr: Type Bonjour
he: סוג Bonjour
ja: Bonjourタイプ
zh_hans: Bonjour 类型

# a11y_bonjour_type_hint
source: Enter the Bonjour type identifier, for example http or ssh
ar: أدخل معرّف نوع Bonjour، مثل http أو ssh
de: Bonjour-Typkennung eingeben, zum Beispiel http oder ssh
es: Introduce el identificador de tipo Bonjour, por ejemplo http o ssh
fr: Entrez l'identifiant de type Bonjour, par exemple http ou ssh
he: הזן את מזהה סוג ה-Bonjour, לדוגמה http או ssh
ja: Bonjourタイプ識別子を入力、例: http または ssh
zh_hans: 输入 Bonjour 类型标识符，例如 http 或 ssh

# a11y_additional_details
source: Additional details
ar: تفاصيل إضافية
de: Weitere Details
es: Detalles adicionales
fr: Détails supplémentaires
he: פרטים נוספים
ja: 追加情報
zh_hans: 其他详情
